165/src/Documents/РасходДенег/РасходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходДенег</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.Соглашения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаEUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсEUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

165/src/Documents/РасходДенег/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СуммаПоДокументуПриИзменении(Элемент)
	
	Если Объект.КурсEUR <> 0 Тогда
		Объект.СуммаEUR = Объект.СуммаПоДокументу / Объект.КурсEUR;
	КонецЕсли;
	Если Объект.КурсUSD <> 0 Тогда
		Объект.СуммаUSD = Объект.СуммаПоДокументу / Объект.КурсUSD;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсEURПриИзменении(Элемент)
	Если Объект.КурсEUR <> 0 Тогда
		Объект.СуммаEUR = Объект.СуммаПоДокументу / Объект.КурсEUR;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КурсUSDПриИзменении(Элемент)
	Если Объект.КурсUSD <> 0 Тогда
		Объект.СуммаUSD = Объект.СуммаПоДокументу / Объект.КурсUSD;
	КонецЕсли;
КонецПроцедуры
